Autodesk.Revit.DB.Structure.RebarShapeTerminationsData.GetDocument
Gets the document containing the end treatment ids.
Returns:
Returns the document containing the  end treatment ids.
Since:
2026

Autodesk.Revit.DB.Structure.RebarShapeTerminationsData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarShapeTerminationsData.HasCrankAtEnd
Identifies if the rebar shape has crank at end.
Setting this property to true, will set the HookAngleAtEnd to 0 and EndTreatmentTypeIdAtEnd to ElementId.InvalidElementId.
Since:
2026

Autodesk.Revit.DB.Structure.RebarShapeTerminationsData.HasCrankAtStart
Identifies if the rebar shape has crank at start.
Setting this property to true, will set the HookAngleAtStart to 0 and EndTreatmentTypeIdAtStart to ElementId.InvalidElementId.
Since:
2026

Autodesk.Revit.DB.Structure.RebarShapeTerminationsData.EndTreatmentTypeIdAtEnd
Identifies the end treatement type at the end of the rebar shape.
Setting this property to a valid value, will set the HookAngleAtEnd to 0 and HasCrankAtEnd to false.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: endTreatmentTypeIdAtEnd doesn't represent an end treatment type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.RebarShapeTerminationsData.EndTreatmentTypeIdAtStart
Identifies the end treatment type at the start of the rebar shape.
Setting this property to a valid value, will set the HookAngleAtStart to 0 and HasCrankAtStart to false.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: endTreatmentTypeIdAtStart doesn't represent an end treatment type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.RebarShapeTerminationsData.HookAngleAtEnd
Identifies the hook angle (in degrees) at the end of the rebar shape.
The angle must be at least 0 and no more than 180. In case it is 0 it will be considered that the shape doesn't have a hook. Common values are 0, 90, 135, and 180.
Setting this property to a value strictly greater than 0 and less or almost equal with 180 will set the HasCrankAtEnd to false and EndTreatmentTypeIdAtEnd to ElementId.InvalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: hookAngleAtEnd must be at least 0 and no more than 180.
Since:
2026

Autodesk.Revit.DB.Structure.RebarShapeTerminationsData.HookAngleAtStart
Identifies the hook angle (in degrees) at the start of the rebar shape.
The angle must be at least 0 and no more than 180. In case it is 0 it will be considered that the shape doesn't have a hook. Common values are 0, 90, 135, and 180.
Setting this property to a value strictly greater than 0 and less or almost equal with 180 will set the HasCrankAtStart to false and EndTreatmentTypeIdAtStart to ElementId.InvalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: hookAngleAtStart must be at least 0 and no more than 180.
Since:
2026

Autodesk.Revit.DB.Structure.RebarShapeTerminationsData.TerminationRotationAngleAtEnd
Identifies the termination's (e.g. hook, crank) out of plane rotation angle (in radians) at the end of the rebar shape.
The default value is 0.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for terminationRotationAngleAtEnd is not finite
Since:
2026

Autodesk.Revit.DB.Structure.RebarShapeTerminationsData.TerminationRotationAngleAtStart
Identifies the termination's (e.g. hook, crank) out of plane rotation angle (in radians) at the start of the rebar shape.
The default value is 0.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for terminationRotationAngleAtStart is not finite
Since:
2026

Autodesk.Revit.DB.Structure.RebarShapeTerminationsData.TerminationOrientationAtEnd
Identifies the orientation of the termination (e.g. hook, crank) at end.
The default value is Left.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.Structure.RebarShapeTerminationsData.TerminationOrientationAtStart
Identifies the orientation of the termination (e.g. hook, crank) at start.
The default value is Left.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.Structure.RebarShapeTerminationsData.#ctor(Autodesk.Revit.DB.Document)
Creates a new instance of RebarShapeTerminationData with the default values.
document:
The document containing the end treatment ids.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.RebarShapeTerminationsData
Class that stores data about rebar shape's terminations (e.g. hooks, cranks, end treatments)
Since:
2026